{"thn": {"1": {"title": "OkCupid Dating App Flaws Could've Let Hackers Read Your Private Messages", "link": "https://thehackernews.com/2020/07/hacking-okcupid-account.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "\"The flaws were identified as part of reverse engineering of OkCupid's Android app version 40.3.1, which was released on April 29 earlier this year.\n\"Users' cookies are sent to the [OkCupid] server since the XSS payload is executed in the context of the application's WebView,\" the researchers said, outlining their method to capture the token information.\n\"The server responds with a vast JSON containing the users' id and the authentication token.\n\"The dire need for privacy and data security becomes far more crucial when so much private and intimate information is being stored, managed and analyzed in an app,\" the researchers concluded.\n\"The app and platform was created to bring people together, but of course where people go, criminals will follow, looking for easy pickings.\""}, "2": {"title": "Hackers Using Google Analytics to Bypass Web Security and Steal Credit Cards", "link": "https://thehackernews.com/2020/06/google-analytics-hacking.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "\"Attackers injected malicious code into sites, which collected all the data entered by users and then sent it via Analytics,\" Kaspersky said in a report published yesterday.\n\"As a result, the attackers could access the stolen data in their Google Analytics account.\n\"The source of the problem is that the CSP rule system isn't granular enough,\" PerimeterX's VP of research Amir Shaked said.\n\"A more granular future direction for strengthening CSP direction to consider as part of the CSP standard is XHR proxy enforcement.\n\"As a customer, unfortunately, there isn't much you can do to safeguard yourself from formjacking attacks."}, "3": {"title": "Hackers Leaked 269 GB of U.S. Police and Fusion Centers Data Online", "link": "https://thehackernews.com/2020/06/law-enforcement-data-breach.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "Alabama Fusion CenterAustin Regional Intelligence CenterBoston Regional Intelligence CenterColorado Information Analysis CenterCalifornia Narcotic Officers' AssociationDelaware Information and Analysis CenterFBI Houston Citizens Academy Alumni AssociationFBI National Academy Association Arkansas/Missouri ChapterFBI National Academy Association Michigan ChapterFBI National Academy Association of TexasFound this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\nA group of hacktivists and transparency advocates has published a massive 269 GB of data allegedly stolen from more than 200 police departments, fusion centers, and other law enforcement agencies across the United States.Dubbed BlueLeaks , the exposed data leaked by thegroup contains hundreds of thousands of sensitive documents from the past ten years with official and personal information.DDoSecrets, or Distributed Denial of Secrets , is a transparency collective similar to WikiLeaks, which publicly publishes data and classified information submitted by leakers and hackers while claiming the organization itself never gets involved in the exfiltration of data.According to the hacktivist group, BlueLeaks dump includes \"police and FBI reports, bulletins, guides and more,\" which \"provides unique insights into law enforcement and a wide array of government activities, including thousands of documents mentioning COVID19.As you can see in the screenshot below, a quick analysis of the BlueLeaks dump shows the data contains over millions of files including images, documents, videos, web pages, text files, emails, audio files, and more, though it's yet to be investigated how many files are classified and are not supposed to be public.Some alerts and guides leaked in BlueLeaks also contained intelligence on the protests, including the recent countrywide Black Lives Matter protests in the U.S. following the death of George Floyd at the time he was in the custody of Minneapolis police.Some of the U.S. agencies listed in BlueLeaks are:It appears that the source of this massive data stems from a security breach at Houston-based web hosting company 'Netsential Inc,' where the webserver for National Fusion Center Association ( NFCA ) is hosted, security blogger Krebs reported Fusion centers are basically information centers that enable intelligence sharing between local, state, tribal, territorial law enforcement and federal agencies, maximizing their ability to detect, prevent, investigate, and respond to criminal and terrorist activities.In a statement, NFCA confirmed Krebs that the \"dates of the files in the leak actually span nearly 24 years — from August 1996 through June 19, 2020 — and that the documents include names, email addresses, phone numbers, PDF documents, images, and a large number of text, video, CSV and ZIP files.\n\"Netsential confirmed that a threat actor had leveraged a compromised Netsential customer user account and the web platform's upload feature and exfiltrated other Netsential customer data, including several U.S. police agencies, including Fusion Centers.Netsential is the same web hosting company that was previously abused by attackers to infect targeted victims with ransomware by sending spoofed spear-phishing emails disguised as NFCA."}, "4": {"title": "Any Indian DigiLocker Account Could've Been Accessed Without Password", "link": "https://thehackernews.com/2020/06/aadhar-digilocker-hacked.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "\"The nature of the vulnerability was such that an individual's DigiLocker account could potentially get compromised if the attacker knew the username for that particular account,\" Digilocker said in a tweet last week acknowledging the flaw.\n\"It was not a vulnerability that could let anyone get access to [the] DigiLocker account of anyone whose username and other details were not known.\n\"\"Upon analysis, it was discovered that this vulnerability had crept in the code when some new features were added recently.\nThe vulnerability was patched on a priority basis by the technical team within a day of getting the alert from CERT-In.\nThis was not an attack on infrastructure, and no data, database, storage, or encryption was compromised,\" the team added."}, "5": {"title": "Joomla Resources Directory (JRD) Portal Suffers Data Breach", "link": "https://thehackernews.com/2020/06/joomla-data-breach.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "Full namesBusiness addressesBusiness email addressesBusiness phone numbersCompany URLsNature of businessEncrypted passwords (hashed)IP addressesNewsletter subscription preferencesJoomla, one of the most popular Open-source content management systems (CMS), last week announced a new data breach impacting 2,700 users who have an account with its resources directory (JRD) website, i.e., resources.joomla.org.The breach exposed affected users' personal information, such as full names, business addresses, email addresses, phone numbers, and encrypted passwords.The company said the incident came to light during an internal website audit that revealed that a member of the Joomla Resources Directory (JRD) team stored a full unencrypted backup of the JRD website on an Amazon Web Services S3 bucket owned by the third-party company.The affected JRD portal lists developers and service providers specialized in Joomla, allowing registered users to extend their CMS with additional functionalities.Joomla said the investigation is still ongoing and that accesses to the website have been temporarily suspended.\nIt has also reached out to the concerned third-party to get the data deleted.\nIt's not clear if any party found the unencrypted backup and accessed the information.The details that could have been potentially accessed by an unauthorized third-party are as follows:The impact of the breach is said to be low, given that most of the information is already in the public domain.In addition to mandating a password reset for all impacted accounts, it's recommended to change them on other sites that reuse the same password to prevent credential stuffing attacks.As a consequence of the audit, Joomla has removed all users who've not logged in before January 1st, 2019, as well as several unused groups.\nFurthermore, it has enabled two-factor authentication and rolled out security fixes on its platform.\n\"Even if we don't have any evidence about data access, we highly recommend people who have an account on the Joomla Resources Directory and use the same password (or combination of an email address and password) on other services to immediately change their password for security reasons,\" Joomla said in the advisory."}, "6": {"title": "Brazil's Biggest Cosmetic Brand Natura Exposes Personal Details of Its Users", "link": "https://thehackernews.com/2020/05/natura-data-breach.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "Full nameMother's maiden nameDate of BirthNationalityGenderHashed login passwords with saltsUsername and nicknameMOIP account detailsAPI credentials with unencrypted passwordsRecent purchasesTelephone numberEmail and physical addressesAccess token for wirecard.com.brFound this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"Around 90% of users were Brazilian customers, although other nationalities were also present, including customers from Peru,\" Anurag said.\n\"The compromised server contained website and mobile site API logs, thereby exposing all production server information.\n\"The risk of phishing and phone scams is also raised by the Natura data leak.\""}, "7": {"title": "British Airline EasyJet Suffers Data Breach Exposing 9 Million Customers' Data", "link": "https://thehackernews.com/2020/05/easyjet-data-breach-hacking.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "Follow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"We take the cybersecurity of our systems very seriously and have robust security measures in place to protect our customers' personal information.\nHowever, this is an evolving threat as cyber attackers get ever more sophisticated,\" says EasyJet Chief Executive Officer Johan Lundgren.\n\"Since we became aware of the incident, it has become clear that owing to COVID-19, there is heightened concern about personal data being used for online scams.\n\"As a precautionary measure recommended by the ICO, the airline has started contacting all customers whose travel and credit card details were accessed in the breach to advise them to be \"extra vigilant, particularly if they receive unsolicited communications."}, "8": {"title": "DigitalOcean Data Leak Incident Exposed Some of Its Customers Data", "link": "https://thehackernews.com/2020/05/digitalocean-data-breach.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "DigitalOcean, one of the biggest modern web hosting platforms, recently hit with a concerning data leak incident that exposed some of its customers' data to unknown and unauthorized third parties.Though the hosting company has not yet publicly released a statement, it did has started warning affected customers of the scope of the breach via an email.According to the breach notification email that affected customers [ 1 2 ] received, the data leak happened due to negligence where DigitalOcean 'unintentionally' left an internal document accessible to the Internet without requiring any password.\n\"Our community is built on trust, so we are taking steps to make sure this doesn't happen again.\nLess than 1% of our customer base was impacted, and the only PII included in the file was account name and email address.\n\"This was not related to a malicious act to access our systems.\nOur customers trust us with their data and we believe that an unintended use of that data, no matter how small, is reason enough to be transparent.\""}, "9": {"title": "Researcher Discloses 4 Zero-Day Bugs in IBM's Enterprise Security Software", "link": "https://thehackernews.com/2020/04/ibm-data-risk-manager-vulnerabilities.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "Authentication BypassCommand InjectionInsecure Default PasswordArbitrary File DownloadCritical Zero-Day Vulnerabilities in IBM Data Risk ManagerUpdate:Found this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"\"IDRM is an enterprise security product that handles very sensitive information.\nI simply wanted to disclose these to IBM responsibly and let them fix it.\nWe have been working on mitigation steps and they will be discussed in a security advisory to be issued.\""}, "10": {"title": "Marriott Suffers Second Breach Exposing Data of 5.2 Million Hotel Guests", "link": "https://thehackernews.com/2020/03/marriott-data-breach.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "International hotel chain Marriott today disclosed a data breach impacting nearly 5.2 million hotel guests, making it the second security incident to hit the company in recent years.\nUpon discovery, we confirmed that the login credentials were disabled, immediately began an investigation, implemented heightened monitoring, and arranged resources to inform and assist guests.\nThe breach, which exposed personal details of over 339 million guests globally, wasn't detected until November 2018, leading to it paying a fine of £99 million ($123 million) to the UK's data privacy regulator Information Commissioner's Office under GDPR laws.\n\"The kinds of information disclosed in the latest Marriott breach might seem innocuous, but it is precisely this kind of intelligence that enables threat actors to better target attacks on consumers,\" Gerrit Lansing, STEALTHbits' Field CTO told The Hacker News via email today.\nCompromised credentials remain one of the top vectors for this kind of compromise, and strong authentication before accessing sensitive information one of the best defenses.\""}, "11": {"title": "How CISOs Should Prepare for Coronavirus Related Cybersecurity Threats", "link": "https://thehackernews.com/2020/03/coronavirus-cybersecurity-ciso.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "In many cases, the functioning of the security team itself is impaired due to missing team members in quarantine, making the detection of malicious activity even harder.From conversations with these companies, it turns out that the operations of many security teams are significantly disturbed due to quarantined team members, causing them to use Cynet's MDR service more often to compensate for the lack of staff.\n'We have reached out to our customers in Italy ', says Gruner, 'and they have confirmed that a significant part of their workforce works from home these days.\n'To sum up the situation in Italy, employees working from home, security teams that are not fully operational and general atmosphere of uncertainty, create ideal conditions for attackers that seek to monetize the new situation through phishing, social engineering, and weaponized emails.The data from Cynet's Italian install base should serve as an illustrative example of the cyber effect in a territory where Coronavirus has a high prevalence.\nWhile this is not yet the case for other countries, the rapid Coronavirus spread implies that the cyber threat landscape in Italy would soon be duplicated in other geolocations as well.In order to efficiently confront these threats, CISOs should evaluate the defenses they have in place and see whether they provide protection against phishing and malicious logins.As a breach protection platform, Cynet introduces a dedicated offering tailored to the new Coronavirus related cyber risks.For both existing and new customers, Cynet will allow, free of charge (for 6 months), the deployment of its product, Cynet 360, on personal computers used by employees working from home.Cynet massively adds staff to CyOps, its MDR services team, to be able to cover for companies with reduced security staff because of the Coronavirus.\nLearn more about Cynet's offering here."}, "12": {"title": "TrueFire Guitar Tutoring Website Suffers Magecart-style Credit Card Breach", "link": "https://thehackernews.com/2020/03/truefire-guitar-tutoring-data-breach.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "Found this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\nOnline guitar tutoring website TrueFire has apparently suffered a 'Magecart' style data breach incident that may have potentially led to the exposure of its customers' personal information and payment card information.is one of the popular guitar tutoring websites with over 1 million users, where wanna-be-guitarists pay online to access a massive library of over 900 courses and 40,000 video lessons.Though TrueFire hasn't yet publicly disclosed or acknowledged the breach, The Hacker News learned about the incident after a few affected customers posted online details of a notification they received from the company last week.The Hacker News also found a copy of the same ' Notice Of Data Breach ' uploaded recently to the website of Montana Department of Justice , specifically on a section where the government shares information on data breaches that also affect Montana residents.Confirming the breach, the notification reveals that an attacker gained unauthorized access to the company's web server somewhere around mid last year and stole payment information of customers that were entered into its website for over five months, between August 3, 2019, and January 14, 2020.\n\"While we do not store credit card information on our website, it appears that the unauthorized person gained access to the site and could have accessed the data of consumers who made payment card purchases while that data was being entered,\" the breach notification says.\n\"We cannot state with certainty that your data was specifically accessed; however, you should know that the information that was potentially subject to unauthorized access includes your name, address, payment card account number, card expiration date, and security code,\" the breach notification says.While the company didn't explain how the attackers managed to compromise its website or if they had injected a digital credit card skimmer on it, the scenario looks very similar to a Magecart style attack For those unaware, Magecart hackers typically compromise websites and secretly insert malicious JavaScript code into their checkout pages that silently captures payment information of customers making purchasing on the sites and then sends it to the attacker's remote server.The company discovered this security incident on January 10 and claimed to have now patched the web vulnerability that allowed attackers to compromise its website in the first place.Guitarists who made any online payment at the TrueFire website between last August and this January are advised to block the payment cards used on it and request a new one from their respective financial institution.Other customers are also advised to be vigilant and keep a close eye on their bank and payment card statements for any unusual activity.As a precaution, all users are also encouraged to change passwords for their TrueFire account and for any other online account where they use the same credentials."}, "13": {"title": "Virgin Media Data Leak Exposes Details of 900,000 Customers", "link": "https://thehackernews.com/2020/03/virgin-media-data-breach.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "Who Discovered the Data Leak?\nWhat is Virgin Media now doing?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"The precise situation is that information stored on one of our databases has been accessed without permission.\n\"We urge people to remain cautious before clicking on an unknown link or giving any details to an unverified or unknown party."}, "14": {"title": "A Massive U.S. Property and Demographic Database Exposes 200 Million Records", "link": "https://thehackernews.com/2020/03/us-property-records-database.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "\"We've been trying to contact Googles cloud security team (IP with database was hosted on their cloud) for them to take down the IP but never got a response,\" the research team told The Hacker News.\n\"No other ways to determine the owner were possible because no reverse DNS records were available due to the cloud-based nature of the IP.\n\"The detailed personal, demographic, and property information contained in this data-set is a gold mine for spammers, scammers, and cybercriminals who run phishing campaigns,\" Comparitech said.\n\"The data allows criminals not only to target specific people but craft a more convincing message.\nIn recent months, Ecuadorian and Russian citizens, and US government personnel have had their personal info left unprotected on Elasticsearch servers, underscoring that there's still a long way to go when it comes to cloud security."}, "15": {"title": "Hackers Compromise T-Mobile Employee' Email Accounts and Steal User' Data", "link": "https://thehackernews.com/2020/03/hackers-compromise-t-mobile-employees.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "names,phone numbers,account numbers,rate plans and features, andbilling information.\nFound this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\nIf you are a T-Mobile customer, this news may concern you.US-based telecom giant T-Mobile has suffered yet another data breach incident that recently exposed personal and accounts information of both its employees and customers to unknown hackers.In a breach notification posted on its website, T-Mobile today said its cybersecurity team recently discovered a sophisticated cyberattack against the email accounts of some of its employees that resulted in unauthorized access to the sensitive information contained in it, including details for its customers and other employees.Although the telecom company did not disclose how the breach happened, when it happened, and exactly how many employees and users were affected, it did confirm that the leaked information on its users doesn't contain financial information like credit card and Social Security numbers.The exposed data of an undisclosed number of affected users include their:The company took necessary steps to shut down the unauthorized access upon discovery and immediately notified law enforcement of the security breach incident.T-Mobile also immediately launched a forensic investigation to determine the extent of the breach incident, a report of which is expected to be released soon..\"We regret that this incident occurred.\nWe take the security of your information very seriously, and while we have a number of safeguards in place to protect customer information from unauthorized access, we are also always working to further enhance security so we can stay ahead of this type of activity,\" the company said.The company is notifying affected customers of the breach incident.Though T-Mobile said it does not have any evidence of the stolen information being used to commit fraud or otherwise misused, it still advises users to change PIN/passcode to access their accounts as a precaution.Affected customers should also be suspicious of phishing emails, which are usually the next step of cybercriminals in an attempt to trick users into giving away their passwords and credit card information.Although the T-Mobile data breach incident did not expose any financial information of affected customers, it is always a good idea to be vigilant and keep a close eye on your bank and payment card statements for any unusual activity and report to the bank if you find any.The incident comes in less than six months after the telecom giant suffered a significant data breach that exposed the personal information of some of the customers using its prepaid services.In August 2018, the company also disclosed a data breach that affected roughly two million customers"}, "16": {"title": "App Used by Israel's Ruling Party Leaked Personal Data of All 6.5 Million Voters", "link": "https://thehackernews.com/2020/02/Israeli-voter-data-leaked.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "Found this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n'According to Ran Bar-Zik , a web security researcher who disclosed the issue, the voters' data was not leaked using any security vulnerability in the Elector app; instead, the incident occurred due to negligence by the software company who leaked the username and password for the administrative panel through an unprotected API endpoint that was listed in the public source code of its homepage, as shown.\n\"Someone visiting the Elector website on a standard browser like Google's Chrome could right-click their mouse on the page and select 'View page source.'\nThe revealed source code for the website contained a link to the 'get-admins-users' page, which the prospective hacker simply had to visit in order to find, out in the open, the passwords of \"admin\" users — those with authorization to manage the database.\""}, "17": {"title": "U.S. Charges 4 Chinese Military Hackers Over Equifax Data Breach", "link": "https://thehackernews.com/2020/02/equifax-chinese-military-hackers.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "Follow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"They used this access to conduct reconnaissance of Equifax's online dispute portal and to obtain login credentials that could be used to further navigate Equifax's network.\nThe defendants spent several weeks running queries to identify Equifax's database structure and searching for sensitive, personally identifiable information within Equifax's system,\" the DoJ said.\n\"\"The defendants took steps to evade detection throughout the intrusion, as alleged in the [nine-count] indictment.\nIn 2014, similar charges were announced against five Chinese military officials for hacking and cyber espionage against several American companies.Besides this, the U.S has also charged the other two Chinese hackers in 2015 for a massive data breach where hackers stole the personal information of over 80 million customers of the Anthem health insurance company.This story is developing and will be updated shortly as details become available."}, "18": {"title": "Wawa Breach: Hackers Put 30 Million Stolen Payment Card Details for Sale", "link": "https://thehackernews.com/2020/01/wawa-credit-card-breach.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "\"While the majority of those records were from US banks and were linked to US-based cardholders, some records also linked to cardholders from Latin America, Europe, and several Asian countries,\" Gemini Advisory said.\n\"Non-US-based cardholders likely fell victim to this breach when traveling to the United States and transacting with Wawa gas stations during the period of exposure.\n\"\"The median price of US-issued records from this breach is currently $17, with some of the international records priced as high as $210 per card.\n\"In the latest statement released yesterday, Wawa confirmed that the company is aware of reports of criminal attempts to sell customers' payment card data and to help further protect its customers, the company has 'alerted payment card processors, payment card brands and card issuers to heighten fraud monitoring activities.\n'\"We continue to encourage our customers to remain vigilant in reviewing charges on their payment card statements and to promptly report any unauthorized use to the bank or financial institution that issued their payment card by calling the number on the back of the card,\" Wawa said.Customers who bought anything from any of the Wawa convenience stores between March and December last year are advised to block the affected cards and request a new one from your respective financial institution."}, "19": {"title": "250 Million Microsoft Customer Support Records Exposed Online", "link": "https://thehackernews.com/2020/01/microsoft-customer-support.html", "categoryname": "Data Breach", "categoryslug": "data%20breach", "summary": "email addresses,IP addresses,Locations,Descriptions of CSS claims and cases,Microsoft support agent emails,Case numbers, resolutions, and remarks,Internal notes marked as \"confidential.\"\n\"The absence of Personally Identifiable Information in the dump is irrelevant here, given that technical support logs frequently expose VIP clients, their internal systems and network configurations, and even passwords.\n\"Worse, many large companies and not only Microsoft have lost visibility of their external attack surface, exposing their clients and partners to significant risks.\n\"\"In this case, as bad as it is, it was discovered by someone who didn't do malicious things with it.\n\"As a result of this incident, the company said it began notifying impacted customers whose data was present in the exposed Customer Service and Support database."}, "20": {"title": "Researcher Demonstrates 4 New Variants of HTTP Request Smuggling Attack", "link": "https://thehackernews.com/2020/08/http-request-smuggling.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "What is HTTP Request Smuggling?\nA new research has identified four new variants of HTTP request smuggling attacks that work against various commercial off-the-shelf web servers and HTTP proxy servers.Amit Klein, VP of Security Research at SafeBreach who presented the findings today at the Black Hat security conference, said that the attacks highlight how web servers and HTTP proxy servers are still susceptible to HTTP request smuggling even after 15 years since they were first documented.\n\"ModSecurity (combined with CRS) is indeed an open source project, but as for robustness and genericity, mod_security has several drawbacks,\" Klein noted.\n\"It doesn't provide full protection against HTTP Request Smuggling [and] it is only available for Apache, IIS and nginx.\n\"To this end, Klein has published a C++-based library that ensures that all incoming HTTP requests are entirely valid, compliant, and unambiguous by enforcing strict adherence to HTTP header format and request line format."}, "21": {"title": "US Government Warns of a New Strain of Chinese 'Taidoor' Virus", "link": "https://thehackernews.com/2020/08/chinese-hacking-malware.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "\"Then last year, NTT Security uncovered evidence of the backdoor being used against Japanese organizations via Microsoft Word documents.\nWhen opened, it executes the malware to establish communication with an attacker-controlled server and run arbitrary commands.According to the latest advisory, this technique of using decoy documents containing malicious content attached to spear-phishing emails hasn't changed.\n\"Taidoor is installed on a target's system as a service dynamic link library (DLL) and is comprised of two files,\" the agencies said.\n\"The first file is a loader, which is started as a service.\nThe loader (ml.dll) decrypts the second file (svchost.dll), and executes it in memory, which is the main Remote Access Trojan (RAT)."}, "22": {"title": "EU sanctions hackers from China, Russia, North Korea who're wanted by the FBI", "link": "https://thehackernews.com/2020/07/sanctions-against-wanted-hackers.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "Two Chinese Individuals—Gao Qiang and Zhang Shilong—and a technology firm, named Tianjin Huaying Haitai Science and Technology Development Co. Ltd, for the Operation Cloud Hopper.\nFour Russian nationals (also wanted by the FBI) — Alexey Valeryevich, Aleksei Sergeyvich, Evgenii Mikhaylovich, and Oleg Mikhaylovich—for attempting to target the Organisation for the Prohibition of Chemical Weapons (OPCW), in the Netherlands.\n(also wanted by the FBI) — Alexey Valeryevich, Aleksei Sergeyvich, Evgenii Mikhaylovich, and Oleg Mikhaylovich—for attempting to target the Organisation for the Prohibition of Chemical Weapons (OPCW), in the Netherlands.\nA North Korean export firm — Chosun Expo, for the WannaCry ransomware attack that made havoc by disrupting information systems worldwide in 2017 and linked to the well-known Lazarus group.\n'On the other hand, the four Russian nationals were agents of the Russian intelligence agency GRU who once aimed to hack into the Wi-Fi network of the OPCW, which, if successful, would have allowed them to compromise the OPCW's ongoing investigatory work."}, "23": {"title": "Industrial VPN Flaws Could Let Attackers Target Critical Infrastructures", "link": "https://thehackernews.com/2020/07/industrial-vpn-security.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "Found this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\nCybersecurity researchers have discovered critical vulnerabilities in industrial VPN implementations primarily used to provide remote access to operational technology (OT) networks that could allow hackers to overwrite data, execute malicious code, and compromise industrial control systems (ICS).A new report published by industrial cybersecurity company Claroty demonstrates multiple severe vulnerabilities in enterprise-grade VPN installations, including Secomea GateManager M2M Server, Moxa EDR-G902, and EDR-G903, and HMS Networks eWon's eCatcher VPN client.These vulnerable products are widely used in field-based industries such as oil and gas, water utilities, and electric utilities to remotely access, maintain and monitor ICS and field devices, including programmable logic controllers (PLCs) and input/output devices.According to Claroty researchers, successful exploitation of these vulnerabilities can give an unauthenticated attacker direct access to the ICS devices and potentially cause some physical damage.In Secomean's GateManager, researchers uncovered multiple security flaws, including a critical vulnerability (CVE-2020-14500) that allows overwriting arbitrary data, executing arbitrary code, or causing a DoS condition, running commands as root, and obtaining user passwords due to the use of a weak hash type.GateManager is a widely used ICS remote access server deployed worldwide as a cloud-based SaaS solution that allows users to connect to the internal network from the internet through an encrypted tunnel while avoiding server setups.The critical flaw, identified as CVE-2020-14500, affects the GateManager component, the main routing instance in the Secomea remote access solution.\nThe flaw occurs due to improper handling of some of the HTTP request headers provided by the client.This flaw can be exploited remotely and without requiring any authentication to achieve remote code execution, which could result in gaining full access to a customer's internal network, along with the ability to decrypt all traffic that passes through the VPN.In Moxa EDR-G902 and EDR-G903 industrial VPN servers, researchers discovered a stack-based buffer overflow bug (CVE-2020-14511) in the system web server that can be triggered just by sending a specially crafted HTTP request, eventually allowing attackers to carry out remote code execution without the need for any credentials.Claroty researchers also tested HMS Networks' eCatcher, a proprietary VPN client that connects to the company's eWon VPN device, and found that the product is vulnerable to a critical stack-based buffer overflow (CVE-2020-14498) that can be exploited to achieve remote code execution.All an attacker needs to do is tricking victims into visiting a malicious website or opening a malicious email containing a specifically crafted HTML element that triggers the flaw in eCatcher, eventually allowing attackers to take complete control of the targeted machine.All three vendors were notified of the vulnerabilities and responded quickly to release security fixes that patch their products' loopholes.Secomea users are recommended to update their products to the newly released GateManager versions 9.2c / 9.2i, Moxa users need to update EDR-G902/3 to version v5.5 by applying firmware updates available for the EDR-G902 series and EDR-G903 series , and HMS Networks users are advised to update eCatcher to Version 6.5.5 or later."}, "24": {"title": "QSnatch Data-Stealing Malware Infected Over 62,000 QNAP NAS Devices", "link": "https://thehackernews.com/2020/07/qnap-nas-malware-attack.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "Cybersecurity agencies in the US and UK yesterday issued a joint advisory about a massive ongoing malware threat infecting Taiwanese company QNAP's network-attached storage (NAS) appliances.Called QSnatch (or Derek), the data-stealing malware is said to have compromised 62,000 devices since reports emerged last October, with a high degree of infection in Western Europe and North America.\n\"All QNAP NAS devices are potentially vulnerable to QSnatch malware if not updated with the latest security fixes,\" the US Cybersecurity and Infrastructure Security Agency (CISA) and the UK's National Cyber Security Centre (NCSC) said in the alert.\n\"Further, once a device has been infected, attackers can prevent administrators from successfully running firmware updates.\nIt's also recommended to follow QNAP's security advisory to prevent the infection by following the steps listed here \"Verify that you purchased QNAP devices from reputable sources,\" CISA and NCSC suggested as part of additional mitigation against QSnatch.\n\"Block external connections when the device is intended to be used strictly for internal storage.\""}, "25": {"title": "Smartwatch Maker Garmin Shuts Down Services After Ransomware Attack", "link": "https://thehackernews.com/2020/07/garmin-ransomware-attack.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "Follow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"\"This outage also affects our call centers, and we are currently unable to receive any calls, emails or online chats.\nHowever, what we do know is every organization is susceptible to ransomware attacks.\nHopefully, Garmin has a daily backup regimen for the company's systems and data.\n\"Garmin has not yet officially confirmed whether the incident is a ransomware attack or not, but we have contacted the company and will update the story as soon as we receive more information on this incident."}, "26": {"title": "4 Dangerous Brazilian Banking Trojans Now Trying to Rob Users Worldwide", "link": "https://thehackernews.com/2020/07/brazilian-banking-trojan.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "\"In order to execute the additional modules, the malware uses the process hollowing technique for hiding the malicious payload inside a whitelisted process, such as svchost.exe,\" Kaspersky said.\n\"The malware enables the attacker to display an overlay window in front of the victim's browser to manipulate the user's session in the background,\" the researchers said.\n\"In this way, the fraudulent transaction is performed from the victim's machine, making it harder to detect for anti-fraud solutions on the bank's end.\n\"As a threat, these banking trojan families try to innovate by using DGA, encrypted payloads, process hollowing, DLL hijacking, a lot of LoLBins, fileless infections and other tricks as a way of obstructing analysis and detection.\nWe believe that these threats will evolve to target more banks in more countries.\""}, "27": {"title": "Advanced StrongPity Hackers Target Syria and Turkey with Retooled Spyware", "link": "https://thehackernews.com/2020/06/strongpity-syria-turkey-hackers.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "\"Interestingly, all files investigated pertaining to the tainted applications appear to have been compiled from Monday to Friday, during normal 9 to 6 UTC+2 working hours,\" the researchers said.\n\"This strengthens the idea that StrongPity could be a sponsored and organized developer team paid to deliver certain 'projects.\nWhat's more, the fake Firefox installer also checks if either ESET or BitDefender antivirus software is installed before dropping the malware.\n\"These characteristics can be interpreted as signs that this threat actor could in fact be part of an enterprise service for hire operation,\" the researchers said.\n\"We believe this has hallmarks a professionally packaged solution due to the similarity of each piece of malware being extremely similar but used across different targets with minor changes.\""}, "28": {"title": "e-Commerce Site Hackers Now Hiding Credit Card Stealer Inside Image Metadata", "link": "https://thehackernews.com/2020/06/image-credit-card-skimmers.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "Using Steganography to Hide Skimmer Code in EXIFAbusing DNS Protocol to Exfiltrate Data from the BrowserIn what's one of the most innovative hacking campaigns, cybercrime gangs are now hiding malicious code implants in the metadata of image files to covertly steal payment card information entered by visitors on the hacked websites.\n\"We found skimming code hidden within the metadata of an image file (a form of steganography) and surreptitiously loaded by compromised online stores,\" Malwarebytes researchers said last week.\n\"This scheme would not be complete without yet another interesting variation to exfiltrate stolen credit card data.\nOnce again, criminals used the disguise of an image file to collect their loot.\n\"DNS traffic does not appear in the browser's debugging tools, is not blocked by a page's Content Security Policy (CSP), and is often not inspected by corporate firewalls or proxies, making it an ideal medium for smuggling data in constrained scenarios,\" Li said."}, "29": {"title": "WikiLeaks Founder Charged With Conspiring With LulzSec & Anonymous Hackers", "link": "https://thehackernews.com/2020/06/wikileaks-lulzsec-anonymous-hackers.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "Found this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"With respect to one target, Assange asked the LulzSec leader to look for (and provide to WikiLeaks) mail and documents, databases, and pdfs.\nIn another communication, Assange told the LulzSec leader that the most impactful release of hacked materials would be from the CIA, NSA, or the New York Times,\" the DoJ said.Assange also obtained and published on WikiLeaks emails from a data breach committed against a U.S. intelligence consulting company by a hacker affiliated with \"Anonymous\" and LulzSec.\nAccording to that hacker, Assange indirectly asked him to spam that victim company again."}, "30": {"title": "Hackers Target Military and Aerospace Staff by Posing as HRs Offering Jobs", "link": "https://thehackernews.com/2020/06/military-aerospace-hacking.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "\"The primary goal of the operation was espionage,\" the researchers told The Hacker News.\nIn this case, we uncovered instances of abuse that involved the creation of fake accounts.\n\"Our research into Operation In(ter)ception shows again how effective spear-phishing can be for compromising a target of interest,\" the researchers concluded.\n\"They were highly targeted and relied on social engineering over LinkedIn and custom, multistage malware.\nTo operate under the radar, the attackers frequently recompiled their malware, abused native Windows utilities, and impersonated legitimate software and companies.\""}, "31": {"title": "Spies Can Listen to Your Conversations by Watching a Light Bulb in the Room", "link": "https://thehackernews.com/2020/06/lamphone-light-bulb-spy.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "Lamphone Attack DemonstrationFrom How Far An Attacker Can Spy On Using the Lamphone Attack?\n\"We assume a victim located inside a room/office that contains a hanging light bulb,\" the researchers said.\nThe researchers recovered an audible extract of President Donald Trump's speech that could be transcribed by Google's Speech to Text API.\n\"We analyze a hanging bulb's response to sound via an electro-optical sensor and learn how to isolate the audio signal from the optical signal.\nBased on our analysis, we develop an algorithm to recover sound from the optical measurements obtained from the vibrations of a light bulb and captured by the electro-optical sensor."}, "32": {"title": "Magecart Targets Emergency Services-related Sites via Insecure S3 Buckets", "link": "https://thehackernews.com/2020/06/magecart-skimmer-amazon.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "\"We first identified the jqueryapi1oad malicious redirector — so named after the cookie we connected with it — in July of 2019,\" the researchers said.\n\"Our research team determined that the actors behind this malicious code were also exploiting misconfigured S3 buckets.\nThen it proceeds to download additional JavaScript code that, in turn, loads a cookie associated with Keitaro traffic distribution system ( TDS ) to redirect traffic to scam ads tied to HookAds malvertising campaign.\n]com is a Colombian soccer news site that's in the top 30,000 of global Alexa rankings.\n\"Misconfigured S3 buckets that allow malicious actors to insert their code into numerous websites is an ongoing issue,\" RiskIQ concluded."}, "33": {"title": "New USBCulprit Espionage Tool Steals Data From Air-Gapped Computers", "link": "https://thehackernews.com/2020/06/air-gap-malware-usbculprit.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "\"One of the newly revealed tools is namedand has been found to rely on USB media in order to exfiltrate victim data,\" Kaspersky said.\n\"This may suggest Cycldek is trying to reach air-gapped networks in victim environments or relies on physical presence for the same purpose.\n\"The characteristics of the malware can give rise to several assumptions about its purpose and use cases, one of which is to reach and obtain data from air-gapped machines,\" the researchers said.\n\"This would explain the lack of any network communication in the malware and the use of only removable media as a means of transferring inbound and outbound data.\n\"Cycldek is an example of an actor that has broader capability than publicly perceived,\" Kaspersky concluded."}, "34": {"title": "Chinese Researchers Disrupt Malware Attack That Infected Thousands of PCs", "link": "https://thehackernews.com/2020/05/chinese-botnet-malware.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "Chinese security firm Qihoo 360 Netlab said it partnered with tech giant Baidu to disrupt a malware botnet infecting over hundreds of thousands of systems.The botnet was traced back to a group it calls ShuangQiang (also called Double Gun ), which has been behind several attacks since 2017 aimed at compromising Windows computers with MBR and VBR bootkits , and installing malicious drivers for financial gain and hijack web traffic to e-commerce sites.In addition to using images uploaded to Baidu Tieba to distribute configuration files and malware — a technique called steganography — the group has begun using Alibaba Cloud storage to host configuration files and Baidu's analytics platform Tongji to manage the activity of its infected hosts, the researchers said.The initial compromise relies on luring unsuspecting users to install game launching software from sketchy game portals that contain malicious code under the guise of a patch.Once the user downloads and installs the patch, it accesses the aforementioned configuration information to download a separate program named \"cs.dll\" from Baidu Tieba that's stored as an image file.In the subsequent stages, \"cs.dll\" not only creates a bot ID and reports it back to the attacker-controlled server, but it also injects a second driver that hijacks system processes (e.g., lassas.exe and svchost.exe) in order to download next-stage payloads to advance the group's motives.Qihoo researchers also detailed a second infection chain wherein game client software is altered with malicious libraries (a modified version of photobase.dll), using a method called DLL hijacking to release and load the malicious driver before loading the legitimate module.The company said it reached out to Baidu's security team on May 14 and that they jointly took action to prevent the further spread of the botnet by blocking all downloads from the URLs involved.\n\"During this joint operation, through the analysis, sharing, and response of threat information, we have formed a better understanding of the technical means, logic, and rules of the Double Gun gang,\" Baidu said."}, "35": {"title": "New ComRAT Malware Uses Gmail to Receive Commands and Exfiltrate Data", "link": "https://thehackernews.com/2020/05/gmail-malware-hacker.html", "categoryname": "Cyber Attack", "categoryslug": "Cyber%20Attack", "summary": "Cybersecurity researchers today uncovered a new advanced version of ComRAT backdoor, one of the earliest known backdoors used by the Turla APT group, that leverages Gmail's web interface to covertly receive commands and exfiltrate sensitive data.\n\"The ComRAT v4 (or \"Chinch\" by the malware authors), as the new successor is called, uses an entirely new code base and is far more complex than its earlier variants, according to ESET.\nIn addition, the PowerShell loader injects a module called ComRAT orchestrator into the web browser, which employs two different channels — a legacy and an email mode — to receive commands from a C2 server and exfiltrate information to the operators.\n\"Version four of ComRAT is a totally revamped malware family released in 2017,\" ESET researcher Matthieu Faou said.\n\"Its most interesting features are the Virtual File System in FAT16 format and the ability to use the Gmail web UI to receive commands and exfiltrate data."}, "36": {"title": "Researcher Demonstrates 4 New Variants of HTTP Request Smuggling Attack", "link": "https://thehackernews.com/2020/08/http-request-smuggling.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "What is HTTP Request Smuggling?\nA new research has identified four new variants of HTTP request smuggling attacks that work against various commercial off-the-shelf web servers and HTTP proxy servers.Amit Klein, VP of Security Research at SafeBreach who presented the findings today at the Black Hat security conference, said that the attacks highlight how web servers and HTTP proxy servers are still susceptible to HTTP request smuggling even after 15 years since they were first documented.\n\"ModSecurity (combined with CRS) is indeed an open source project, but as for robustness and genericity, mod_security has several drawbacks,\" Klein noted.\n\"It doesn't provide full protection against HTTP Request Smuggling [and] it is only available for Apache, IIS and nginx.\n\"To this end, Klein has published a C++-based library that ensures that all incoming HTTP requests are entirely valid, compliant, and unambiguous by enforcing strict adherence to HTTP header format and request line format."}, "37": {"title": "Adobe Issues July 2020 Critical Security Patches for Multiple Software", "link": "https://thehackernews.com/2020/07/adobe-security-patch-july.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "Adobe Creative Cloud Desktop ApplicationAdobe Media EncoderAdobe Genuine ServiceAdobe ColdFusionAdobe Download ManagerAdobe today released software updates to patch a total of 13 new security vulnerabilities affecting 5 of its widely used applications.Out of these 13 vulnerabilities, four have been rated critical, and nine are important in severity.The affected products that received security patches today include:Adobe Creative Cloud Desktop Application versions 5.1 and earlier for Windows operating systems contain four vulnerabilities, one of which is a critical symlink issue (CVE-2020-9682) leading to arbitrary file system write attacks.According to the advisory , the other three important flaws in this Adobe software are privilege escalation issues.\nAdobe Media Encoder contains two critical arbitrary code execution (CVE-2020-9650 and CVE-2020-9646) and one important information disclosure issues, affecting both Windows and macOS users running Media Encoder version 14.2 or earlier.\nAdobe Genuine Service , a utility in Adobe suite that prevents users from running non-genuine or cracked pirated software, is affected by three important privilege escalation issues.\nThese flaws reside in software version 6.6 and earlier for Windows and macOS operating systems.Adobe's web-application development platform ColdFusion also suffers from two important severity privilege escalation issues that can be carried out by exploiting the DLL search-order hijacking attack.At last, Adobe Download Manager has been found vulnerable to only one flaw (CVE-2020-9688) that's critical in severity and could lead to arbitrary code execution in the current user context through command injection attack.The flaw affects Adobe Download Manager version 2.0.0.518 for Windows and has been patched with the release of version 2.0.0.529 of the software.None of the security vulnerabilities fixed in this batch of Adobe updates were publicly disclosed or found being exploited in the wild.However, it's still highly recommended that Adobe users download and install the latest versions of the affected software to protect their systems and businesses from potential cyber-attacks.That's also because many patches released in today's batch have received a priority rating of 2, meaning similar flaws have previously been seen exploited in the wild, and for now, the company has found no evidence of any exploitation of these vulnerabilities."}, "38": {"title": "New Highly-Critical SAP Bug Could Let Attackers Take Over Corporate Servers", "link": "https://thehackernews.com/2020/07/sap-netweaver-vulnerability.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "SAP has patched a critical vulnerability impacting the LM Configuration Wizard component in NetWeaver Application Server (AS) Java platform, allowing an unauthenticated attacker to take control of SAP applications.The bug, dubbed RECON and tracked as, is rated with a maximum CVSS score of 10 out of 10, potentially affecting over 40,000 SAP customers, according to cybersecurity firm Onapsis, which uncovered the flaw \"If successfully exploited, a remote, unauthenticated attacker can obtain unrestricted access to SAP systems through the creation of high-privileged users and the execution of arbitrary operating system commands with the privileges of the SAP service user account, which has unrestricted access to the SAP database and is able to perform application maintenance activities, such as shutting down federated SAP applications,\" the US Cybersecurity and Infrastructure Security Agency (CISA) said in an advisory \"The confidentiality, integrity, and availability of the data and processes hosted by the SAP application are at risk by this vulnerability,\" it added.The vulnerability is present by default in SAP applications running on top of SAP NetWeaver AS Java 7.3 and newer (up to SAP NetWeaver 7.5), putting several SAP business solutions at risk, including but not limited to SAP Enterprise Resource Planning, SAP Product Lifecycle Management, SAP Customer Relationship Management, SAP Supply Chain Management, SAP Business Intelligence, and SAP Enterprise Portal.According to Onapsis, RECON is caused due to a lack of authentication in the web component of the SAP NetWeaver AS for Java, thus granting an attacker to perform high-privileged activities on the susceptible SAP system.\n\"A remote, unauthenticated attacker can exploit this vulnerability through an HTTP interface, which is typically exposed to end users and, in many cases, exposed to the internet,\" CISA said.By exploiting the flaw to create a new SAP user with maximum privileges, the intruder can compromise SAP installations to execute arbitrary commands, such as modifying or extracting highly sensitive information as well as disrupting critical business processes.Although there's no evidence of any active exploitation of the vulnerability, CISA cautioned that the patches' availability could make it easier for adversaries to reverse-engineer the flaw to create exploits and target unpatched systems.Given the severity of RECON, it's recommended that organizations apply critical patches as soon as possible and scan SAP systems for all known vulnerabilities and analyze systems for malicious or excessive user authorizations."}, "39": {"title": "Critical Bugs and Backdoor Found in GeoVision's Fingerprint and Card Scanners", "link": "https://thehackernews.com/2020/06/geovision-scanner-vulnerabilities.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "\"Malicious attackers can establish persistence on the network and spy on internal users, steal data — without ever getting detected,\" Acronis said.\n\"They can reuse your fingerprint data to enter your home and/or personal devices, and photos can be easily reused by malicious actors to perpetrate identity theft based on biometric data.\nEven more troublingly, it has a CVSS rating of 10, making it a critical flaw.Acronis said it initially approached GeoVision last August, subsequently twice in September and December, in addition to contacting SingCERT with their findings.\n\"It's quite surreal seeing some vendors not rushing to fix critical vulnerabilities — in addition to the low quality of the initial source code, the presence of back doors is concerning.\nIt shows that IoT security is flawed, and each company must understand that using such devices can leave them exposed to prolonged unmitigated risks.\""}, "40": {"title": "Oracle E-Business Suite Flaws Let Hackers Hijack Business Operations", "link": "https://thehackernews.com/2020/06/oracle-e-business-suite.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "Together, they can be exploited even if EBS customers have deployed patches released in April 2019.\n\"For example, an attacker could modify the Trial Balance Report, which summarizes accounting balances in a given period, virtually unnoticed, resulting in inaccurately reported results flowing undetected into the financial statements.\n\"Organizations need to be aware that current GRC tools and other traditional security methods (firewalls, access controls, SoD and others) would be ineffective against preventing this type of attack on vulnerable Oracle EBS systems,\" the researchers cautioned.\n\"If organizations have internet-facing Oracle EBS systems, the potential threat likelihood would be significantly magnified.\nOrganizations under attack will be unaware of the attack and not know the extent of the damage until evidence is found by a very extensive internal or external audit.\""}, "41": {"title": "Intel CPUs Vulnerable to New 'SGAxe' and 'CrossTalk' Side-Channel Attacks", "link": "https://thehackernews.com/2020/06/intel-sgaxe-crosstalk-attacks.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "SGAxe Attack: Extracting Sensitive Data From SGX EnclavesCrossTalk Attack: Leaking Information Across CPU coresFound this article interesting?\nIt offers safeguards against the modification of sensitive software and data by malicious actors that may have broken into the target (virtual) machine.SGAxe builds on the CacheOut speculative execution attack to steal SGX data.\nAttestation is a mechanism offered as part of SGX that lets enclaves prove to third parties that they have been correctly initialized on a genuine Intel processor.\n\"In a nutshell, we use CacheOut to recover the sealing keys from within the address space of Intel's production quoting enclave,\" the researchers stated.\n\"The majority of current mitigations rely on spatial isolation on boundaries which are no longer applicable due to the cross-core nature of these attacks."}, "42": {"title": "SMBleed: A New Critical Vulnerability Affects Windows SMB Protocol", "link": "https://thehackernews.com/2020/06/SMBleed-smb-vulnerability.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "\"The message structure contains fields such as the amount of bytes to write and flags, followed by a variable-length buffer,\" the researchers said.\n\"That's perfect for exploiting the bug since we can craft a message such that we specify the header, but the variable-length buffer contains uninitialized data.\n\"\"An attacker who successfully exploited the vulnerability could obtain information to further compromise the user's system.\nTo exploit the vulnerability against a server, an unauthenticated attacker could send a specially crafted packet to a targeted SMBv3 server,\" Microsoft said in its advisory.\n\"To exploit the vulnerability against a client, an unauthenticated attacker would need to configure a malicious SMBv3 server and convince a user to connect to it,\" Microsoft added.Worse, SMBleed can be chained with SMBGhost on unpatched Windows 10 systems to achieve remote code execution."}, "43": {"title": "Microsoft Releases June 2020 Security Patches For 129 Vulnerabilities", "link": "https://thehackernews.com/2020/06/windows-update-june.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "Found this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"In an email attack scenario, an attacker could exploit the vulnerability by sending the specially crafted image to the user.\nAn attacker who successfully exploited this vulnerability could cause a system to load remote images.\nThese images could disclose the IP address of the targeted system to the attacker,\" the advisory says.Besides these, the June 2020 update also includes a patch for a new critical remote code execution flaw ( CVE-2020-9633 ) affecting Adobe Flash Player for Windows systems.It's recommended that all users apply the latest security patches as soon as possible to prevent malware or miscreants from exploiting them to gain remote control over vulnerable computers.For installing the latest security updates, Windows users can head to Start > Settings > Update & Security > Windows Update, or by selecting Check for Windows updates."}, "44": {"title": "Any Indian DigiLocker Account Could've Been Accessed Without Password", "link": "https://thehackernews.com/2020/06/aadhar-digilocker-hacked.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "\"The nature of the vulnerability was such that an individual's DigiLocker account could potentially get compromised if the attacker knew the username for that particular account,\" Digilocker said in a tweet last week acknowledging the flaw.\n\"It was not a vulnerability that could let anyone get access to [the] DigiLocker account of anyone whose username and other details were not known.\n\"\"Upon analysis, it was discovered that this vulnerability had crept in the code when some new features were added recently.\nThe vulnerability was patched on a priority basis by the technical team within a day of getting the alert from CERT-In.\nThis was not an attack on infrastructure, and no data, database, storage, or encryption was compromised,\" the team added."}, "45": {"title": "Two Critical Flaws in Zoom Could've Let Attackers Hack Systems via Chat", "link": "https://thehackernews.com/2020/06/zoom-video-software-hacking.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "Found this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"Zoom's chat functionality is built on top of XMPP standard with additional extensions to support the rich user experience.\nOne of those extensions supports a feature of including source code snippets that have full syntax highlighting support.\nThe feature to send code snippets requires the installation of an additional plugin but receiving them does not."}, "46": {"title": "Newly Patched SAP ASE Flaws Could Let Attackers Hack Database Servers", "link": "https://thehackernews.com/2020/06/newly-patched-sap-ase-flaws-could-let.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "\"During database backup operations, there are no security checks for overwriting critical configuration files,\" Trustwave researchers said in a report shared with The Hacker News.\n\"That means anyone who can run the DUMP command (e.g., database owners) can perform very dangerous tasks.\n\"A second vulnerability ( CVE-2020-6252 ) concerns ASE Cockpit, a web-based administrative console that's used for monitoring the status and availability of ASE servers.\n\"The logs are only readable to the SAP account, but when joined with some other issue which allows filesystem access, [it] will completely compromise the SAP ASE,\" the researchers noted.After Trustwave responsibly disclosed the findings to Sybase, SAP addressed the issues in a patch that was pushed last month on May 12.\n\"Organizations often store their most critical data in databases, which, in turn, are often necessarily exposed in untrusted or publicly exposed environments,\" Trustwave said."}, "47": {"title": "Critical VMware Cloud Director Flaw Lets Hackers Take Over Corporate Servers", "link": "https://thehackernews.com/2020/06/vmware-cloud-director-exploit.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "Modify the system database to access foreign virtual machines (VM) assigned to different organizations within Cloud Director.\nEscalate privileges from \"Organization Administrator\" to \"System Administrator\" with access to all cloud accounts by merely changing the password via an SQL query.\nModify the Cloud Director's login page, allowing the attacker to capture passwords of another customer in plaintext, including System Administrator accounts.\n\"In general, cloud infrastructure is considered relatively safe because different security layers are being implemented within its core, such as encryption, isolating of network traffic, or customer segmentations.\nHowever, security vulnerabilities can be found in any type of application, including the Cloud providers themselves,\" Tomas Zatko, CEO of Citadelo, said."}, "48": {"title": "Exclusive – Any Mitron (Viral TikTok Clone) Profile Can Be Hacked in Seconds", "link": "https://thehackernews.com/2020/05/titok-mitron-app-hacking.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "Any Mitron Users Account Can Be Hacked in SecondsMitron App Was Not Developed; Instead Bought For Just $34Who is Behind the Mitron App?\nIs Mitron App Safe to Use?\nthe vulnerability has not yet been patched,the owner of the app is unknown,the privacy policy of the service doesn't exist, andthere are no terms of use,Found this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\nHe paid for the script and used it, which is okay."}, "49": {"title": "New Bluetooth Vulnerability Exposes Billions of Devices to Hackers", "link": "https://thehackernews.com/2020/05/hacking-bluetooth-vulnerability.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "\"The Bluetooth specification contains vulnerabilities enabling to perform impersonation attacks during secure connection establishment,\" the researchers outlined in the paper.\n\"Given the widespread impact of the vulnerability, the researchers said they responsibly disclosed the findings to the Bluetooth Special Interest Group (SIG), the organization that oversees the development of Bluetooth standards, in December 2019.The Bluetooth SIG acknowledged the flaw, adding it has made changes to resolve the vulnerability.\n\"In addition to urging companies to apply the necessary patches, the organization is recommending Bluetooth users to install the latest updates from device and operating system manufacturers.\n\"The BIAS attacks are the first uncovering issues related to Bluetooth's secure connection establishment authentication procedures, adversarial role switches, and Secure Connections downgrades,\" the research team concluded.\n\"The BIAS attacks are stealthy, as Bluetooth secure connection establishment does not require user interaction.\""}, "50": {"title": "Critical SaltStack RCE Bug (CVSS Score 10) Affects Thousands of Data Centers", "link": "https://thehackernews.com/2020/05/saltstack-rce-vulnerability.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "Vulnerabilities in ZeroMQ ProtocolDetecting Vulnerable Salt MastersTwo severe security flaws have been discovered in the open-source SaltStack Salt configuration framework that could allow an adversary to execute arbitrary code on remote servers deployed in data centers and cloud environments.The vulnerabilities were identified by F-Secure researchers earlier this March and disclosed on Thursday, a day after SaltStack released a patch (version 3000.2) addressing the issues , rated with CVSS score 10.\n\"The researchers warned that the flaws could be exploited in the wild imminently.\nAdditionally, the master uses two ZeroMQ channels, a \"request server\" to which minions report the execution results and a \"publish server,\" where the master publishes messages that the minions can connect and subscribe to.According to F-Secure researchers, the pair of flaws reside within the tool's ZeroMQ protocol.\n\"The impact is full remote command execution as root on both the master and all minions that connect to it.\n\"Exploitation of the authentication vulnerabilities will result in the ASCII strings \"_prep_auth_info\" or \"_send_pub\" appearing in data sent to the request server port (default 4506),\" it added.It's highly recommended that Salt users update the software packages to the latest version."}, "51": {"title": "CISA Warns Patched Pulse Secure VPNs Could Still Expose Organizations to Hackers", "link": "https://thehackernews.com/2020/04/pulse-secure-vpn-vulnerability.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "A Remote Code Execution FlawUnpatched VPN Servers Become Lucrative TargetThe United States Cybersecurity and Infrastructure Security Agency (CISA) yesterday issued a fresh advisory alerting organizations to change all their Active Directory credentials as a defense against cyberattacks trying to leverage a known remote code execution (RCE) vulnerability in Pulse Secure VPN servers—even if they have already patched it.The warning comes three months after another CISA alert urging users and administrators to patch Pulse Secure VPN environments to thwart attacks exploiting the vulnerability.\n\"Threat actors who successfully exploited CVE-2019-11510 and stole a victim organization's credentials will still be able to access — and move laterally through — that organization's network after the organization has patched this vulnerability if the organization did not change those stolen credentials,\" CISA said.CISA has also released a tool to help network administrators look for any indicators of compromise associated with the flaw.Tracked as CVE-2019-11510 , the pre-authentication arbitrary file read vulnerability could allow remote unauthenticated attackers to compromise vulnerable VPN servers and gain access to all active users and their plain-text credentials, and execute arbitrary commands.The flaw stems from the fact that directory traversal is hard-coded to be allowed if a path contains \"dana/html5/acc,\" thus allowing an attacker to send specially crafted URLs to read sensitive files, such as \"/etc/passwd\" that contains information about each user on the system.To address this issue, Pulse Secure released an out-of-band patch on April 24, 2019.While on August 24, 2019, security intelligence firm Bad Packets was able to discover 14,528 unpatched Pulse Secure servers, a subsequent scan as of last month yielded 2,099 vulnerable endpoints , indicating that a vast majority of organizations have patched their VPN gateways.The fact that there are still over thousands of unpatched Pulse Secure VPN servers has made them a lucrative target for bad actors to distribute malware.A report from ClearSky found Iranian state-sponsored hackers using CVE-2019-11510 , among others, to penetrate and steal information from target IT and telecommunication companies across the world.According to an NSA advisory from October 2019, the \"exploit code is freely available online via the Metasploit framework, as well as GitHub.\nMalicious cyber actors are actively using this exploit code.\n\"In a similar alert issued last year, the UK's National Cyber Security Centre ( NCSC ) warned that advanced threat groups are exploiting the vulnerability to target government, military, academic, business, and healthcare organizations.More recently, Travelex , the foreign currency exchange and travel insurance firm, became a victim after cybercriminals planted Sodinokibi (REvil) ransomware on the company's networks via the Pulse Secure vulnerability.\nAlthough the ransomware operators demanded a ransom of $6 million (£4.6 million), a Wall Street Journal report last week said it paid $2.3 million in the form of 285 Bitcoin to resolve its problem.In the face of ongoing attacks, it's recommended that organizations upgrade their Pulse Secure VPN, reset their credentials, and scan for unauthenticated log requests and exploit attempts.CISA has also suggested removing any unapproved remote access programs and inspecting scheduled tasks for scripts or executables that may allow an attacker to connect to an environment.For more steps to mitigate the flaw, head to NSA's advisory here"}, "52": {"title": "Critical RCE Bug Affects Millions of OpenWrt-based Network Devices", "link": "https://thehackernews.com/2020/03/openwrt-rce-vulnerability.html", "categoryname": "Vulnerability", "categoryslug": "Vulnerability", "summary": "\"As a stopgap solution, OpenWRT removed the space in the SHA256sum from the package list shortly after I reported the bug,\" Vranken said.\n\"However, this is not an adequate long-term solution because an attacker can simply provide an older package list that was signed by the OpenWRT maintainers.\"\nFound this article interesting?\nFollow THN on Facebook Twitter  and LinkedIn to read more exclusive content we post.\n\"Due to the fact that opkg on OpenWrt runs as root and has write access to the entire filesystem, arbitrary code could be injected by means of forged .ipk packages with a malicious payload,\" OpenWrt team said.The remote exploitation of this vulnerability is possible due to the fact that integrity in Linux based software installation mechanisms rely on digitally signing files while downloading files over the insecure HTTP connection.Besides this, to exploit the vulnerability, attackers also need to serve a malicious package with the size equals to that specified in the package list on downloads.openwrt.org.According to the project team, OpenWrt versions 18.06.0 to 18.06.6 and 19.07.0, as well as LEDE 17.01.0 to 17.01.7, are affected.To fix this issue, affected users are advised to upgrade their device firmware to the latest OpenWrt versions 18.06.7 and 19.07.1, which were released last month."}, "53": {"title": "US Government Warns of a New Strain of Chinese 'Taidoor' Virus", "link": "https://thehackernews.com/2020/08/chinese-hacking-malware.html", "categoryname": "Malware", "categoryslug": "Malware", "summary": "\"Then last year, NTT Security uncovered evidence of the backdoor being used against Japanese organizations via Microsoft Word documents.\nWhen opened, it executes the malware to establish communication with an attacker-controlled server and run arbitrary commands.According to the latest advisory, this technique of using decoy documents containing malicious content attached to spear-phishing emails hasn't changed.\n\"Taidoor is installed on a target's system as a service dynamic link library (DLL) and is comprised of two files,\" the agencies said.\n\"The first file is a loader, which is started as a service.\nThe loader (ml.dll) decrypts the second file (svchost.dll), and executes it in memory, which is the main Remote Access Trojan (RAT)."}, "54": {"title": "Over 100 New Chrome Browser Extensions Caught Spying On Users", "link": "https://thehackernews.com/2020/06/chrome-browser-extensions-spying.html", "categoryname": "Malware", "categoryslug": "Malware", "summary": "Google recently removed 106 more extensions from its Chrome Web Store after they were found illegally collecting sensitive user data as part of a \"massive global surveillance campaign\" targeting oil and gas, finance, and healthcare sectors.Awake Security, which disclosed the findings late last week, said the malicious browser add-ons were tied back to a single internet domain registrar, GalComm.However, it's not immediately clear who is behind the spyware effort.\n\"This campaign and the Chrome extensions involved performed operations such as taking screenshots of the victim device, loading malware, reading the clipboard, and actively harvesting tokens and user input,\" Awake Security said.The extensions in question posed as utilities offering capabilities to convert files from one format to the other, among other tools for secure browsing, while relying on thousands of fake reviews to trick unsuspecting users into installing them.Furthermore, the actors behind the operation leveraged evasion techniques to avoid flagging the domains as malicious by anti-malware solutions, thereby allowing the surveillance campaign to go undetected.In total, the extensions were downloaded nearly 33 million times over the course of three months before Awake Security reached out to Google in May.The search giant, in response to the disclosures, has deactivated the problematic browser extensions.\nThe full list of offending extension IDs can be accessed here Telemetry data has revealed that some of these extensions were active on the networks of \"financial services, oil and gas, media and entertainment, healthcare and pharmaceuticals, retail, high-tech, higher education, and government organizations,\" although there's no evidence that they were actually used to collect sensitive data.\n\"Galcomm is not involved, and not in complicity with any malicious activity whatsoever,\" the Israel-based registrar's owner Moshe Fogel told Reuters, which broke the development.Deceptive extensions on the Chrome Web Store have continued to be a problem, what with bad actors exploiting it for malvertising and other data-stealing campaigns.Earlier this February, Google removed 500 malware-ridden extensions after they were caught serving adware and sending users' browsing activity to attacker-controlled servers.\nThen in April, the company yanked another set of 49 extensions that masqueraded as cryptocurrency wallets to steal Keystore information.It's recommended that users review extension permissions by visiting \"chrome://extensions\" on the Chrome browser, consider uninstalling those that are rarely used, or switch to other software alternatives that don't require invasive access to browser activity."}, "55": {"title": "Hackers Target Military and Aerospace Staff by Posing as HRs Offering Jobs", "link": "https://thehackernews.com/2020/06/military-aerospace-hacking.html", "categoryname": "Malware", "categoryslug": "Malware"}}}